# Импортируем класс datetime из модуля datetime
from datetime import datetime
# Импортируем функцию sqrt из модуля math
from math import sqrt

def main(**kwargs):
    """
    Функция выполняет проход по переданным параметрам,
    высчитывает арифметическое выражение и выводит результат
    """
    # запускает цикл для каждого переданного аргумента
    for key in kwargs.items():
        # вычисляется арифметическое выражение
        result = sqrt(key[1][0] ** 2 + key[1][1] ** 2)
        # печатается результат
        print(result)

# проверяется - запускается модуль напрямую или испортируется
if __name__ == '__main__':
    # возвращает текущее время
    start_time = datetime.now()
    # вызывается функция main() с передачей аргументов
    main(one=[10, 3], two=[5, 4], three=[15, 13], four=[93, 53], five=[133, 15])

    # высчитывается время выполнения программы
    time_costs = datetime.now() - start_time
    # печатается вывод времени
    print(f"Время выполнения программы - {time_costs}")